back-end/app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    questions = Question.all