back-end/app/controllers/test_results_controller.rb

SELECT "test_results".* FROM "test_results"
---
    def index
        testresults = TestResult.all