back-end/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test User"], ["created_at", "2020-03-25 16:15:39.146710"], ["updated_at", "2020-03-25 16:15:39.146710"]]
---
    def create
        name = params[:name]
        user = User.create(name: name)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
        user = User.find_by(id: params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def user_questions
        user = User.find_by(id: params[:id])